
/*
  Налаштування прототипу дочірнього елемента на екземпляр батьківського елемента
У попередньому завданні ви побачили перший крок для успадкування поведінки від супертипу (або батька) Animal: створення нового екземпляру Animal.

Це завдання присвячене наступному кроку: налаштуванню prototype підтипу (або дочірнього елемента) — у нашому випадку Bird — як екземпляр Animal.

Bird.prototype = Object.create(Animal.prototype);
Пам’ятайте, що prototype є своєрідним «рецептом» для створення об’єкта. Таким чином ключові «інгредієнти» з Animal тепер є частиною рецепту Bird.

let duck = new Bird("Donald");
duck.eat();
duck успадковує усі властивості Animal, включно з методом eat.

Змініть код, щоб екземпляри Dog успадковували від Animal.


/* ============================================================================================================== */

function Animal() { }

Animal.prototype = {
  constructor: Animal,
  eat: function () {
    console.log("nom nom nom");
  }
};

function Dog() { }

// Змініть код лише під цим рядком
Dog.prototype = Object.create(Animal.prototype);

let beagle = new Dog();




