
/*
  Вираз негайно викликаної функції (IIFE)
Часто у JavaScript виконують функцію одразу після її оголошення:

(function () {
  console.log("Chirp, chirp!");
})();
Це анонімний вираз функції, яка одразу виконується та виводить Chirp, chirp!.

Зверніть увагу, що функція не має назви та не зберігається у змінній. Дві дужки () наприкінці виразу сприяють негайному виконанню або виклику. Це відомо як вираз негайно викликаної функції або IIFE.

Перепишіть функцію makeNest та видаліть виклик, щоб це був анонімний вираз негайно викликаної функції (IIFE).

/* ============================================================================================================== */

(() => {
  console.log("A cozy nest is ready");
})();




